# IFCProperty Mapping Info Methods

Source: https://www.revitapidocs.com/2026/bc3a1f58-e942-07cc-207c-71aa9a90b123.htm

---

| IFCProperty Mapping Info Methods |
| --- |

The IFCPropertyMappingInfo type exposes the following members.

Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | IsValidMappingInfo | Defines whether the mapping info contains meaningful data. |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top See Also

#### Reference

IFCPropertyMappingInfo Class Autodesk.Revit.DB Namespace